Сущности:
Категории продукции
Контакты
Клиенты
Сотрудники
Территории
Заказы
Детали заказов
Продукция
Перевозчики
Поставщики

Взаимосвязи:

1) Категории продукции - Продукция: один-ко-многим
2) Поставщики - Продукция: один-ко-многим
3) Сотрудники - Территории: один-ко-многим
4) Заказы - Детали заказов: один-ко-многим
5) Детали заказов - Продукция: многие-ко-многим
6) Сотрудники - Заказы: один-ко-многим
7) Клиенты - Заказы: один-ко-многим
8) Клиенты - Контакты: один-к-одному
9) Сотрудники - Контакты: один-к-одному
10) Перевозчики - Контакты: один-к-одному
11) Поставщики - Контакты: один-к-одному
12) Регионы - Территории: один-ко-многим
13) Сотрудники - Территории: один-ко-многим